Revit 2026 API

# LineCreateBound Method

---

Creates a new instance of a bound linear curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Line CreateBound(
	XYZ endpoint1,
	XYZ endpoint2
)
```
```vb
Public Shared Function CreateBound (
	endpoint1 As XYZ,
	endpoint2 As XYZ
) As Line
```
```cpp
public:
static Line^ CreateBound(
	XYZ^ endpoint1,
	XYZ^ endpoint2
)
```
```fsharp
static member CreateBound :
        endpoint1 : XYZ *
        endpoint2 : XYZ -> Line
```

#### Parameters

endpoint1 XYZ
     The first line endpoint.
endpoint2 XYZ
     The second line endpoint.

#### Return Value

Line The new bound line.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was NULL |
| ArgumentsInconsistentException | Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance). |

#### Reference

Line Class

Autodesk.Revit.DB Namespace